# PointElementZflipped Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointElementZflipped Property
ParameterTypeId Class See Also
---
"Flipped"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointElementZflipped { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointElementZflipped As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointElementZflipped {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace